Practicas/PracticasGretl/pub/Lecc07.tex
% Created 2023-11-10 vie 14:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 7}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Contrastes de hipótesis simples}
\label{sec:orgd63c7d0}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/HtestingHouses.inp}{HtestingHouses.inp}\\[0pt]
\end{tabular}
\end{center}

\begin{description}
\item[{Nota 1}] la función \texttt{pvalue(t,gl,Valor)} calcula la probabilidad a
la derecha de \texttt{Valor} (Por tanto, puede calcular la
probabilidad por la izquierda así:
\begin{center}
\begin{tabular}{lll}
\texttt{1-pvalue(t,gl,Valor)}, & o bien así: & \texttt{pvalue(t,gl,-Valor)}\\[0pt]
\end{tabular}
\end{center}

\item[{Nota 2}] Es posible que necesite ejecutar todas las órdenes desde
la línea de comandos (es decir, sin menús ni ratón).
\end{description}

Cargue los datos \texttt{data3-1.gdt} del libro de Ramanathan.
\begin{verbatim}
open data3-1
\end{verbatim}

\begin{enumerate}
\item Ajuste por MCO el precio en función de la superficie y guarde el
modelo como icono
\begin{verbatim}
Modelo   <- ols price const sqft
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_2=0.1\) frente a \(\Halt:\
   \beta_2>0.1\) con una significación del 5\%. Calcule el \emph{p}-valor
del estadístico.
\begin{verbatim}
# Hnula (b2=0.1)    Halt (b2>0.1)
scalar t1 = ($coeff(sqft)-0.1)/$stderr(sqft)
scalar c1 = critical(t,$df,.05)
scalar p1 = pvalue(t,$df,t1)    
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_2=0.15\) frente a \(\Halt:\
   \beta_2<0.15\) con una significación del 5\%. Calcule el \emph{p}-valor
del estadístico.
\begin{verbatim}
# Hnula (b2=0.15) Halt (b2<0.15) 
scalar t2 = ($coeff(sqft)-0.15)/$stderr(sqft)
scalar c2 = -1*critical(t,$df,.05)          # alternativa A
scalar c2 =    critical(t,$df,.95)          # alternativa B
scalar p2 = 1-pvalue(t,$df, t2)             # Alternativa 1
scalar p2 =   pvalue(t,$df,-t2)             # Alternativa 2    
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_1=0\) frente a \(\Halt:\ \beta_1<0\)
con una significación del 5\%. Calcule el \emph{p}-valor del
estadístico.
\begin{verbatim}
# Hnula (b1=0)    Halt (b1<0) 
scalar t3 = ($coeff(const)-0)/$stderr(const)
scalar c3 =   critical(t,$df,.95)
scalar p3 = 1-pvalue(t,$df,t3)
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_1=0\) frente a \(\Halt:\ \beta_1>0\)
con una significación del 5\%. Calcule el \emph{p}-valor del
estadístico.
\begin{verbatim}
# Hnula (b1=0)    Halt (b1>0) 
scalar t3 = ($coeff(const)-0)/$stderr(const)
scalar c3 = critical(t,$df,.05)
scalar p3 = pvalue(t,$df,t3)
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_2=0.15\) frente a \(\Halt:\
   \beta_2\ne0.15\) con una significación del 5\%. Calcule el \emph{p}-valor
del estadístico.
\begin{verbatim}
# Hnula (b2=0.15)  Halt (b1~=0.15) Bilateral
scalar t4 = ($coeff(sqft)-0.15)/$stderr(sqft)
scalar c4 = critical(t,$df,.025)
scalar p4 = 2*pvalue(t,$df,abs(t4))
scalar f4 = t4^2
scalar pf4 = pvalue(f,1,$df,f4)    
\end{verbatim}

\item Efectúe los cálculos necesarios para obtener el estadístico \(t\)
para contrastar \(\Hnula:\ \beta_1+\beta_2=10\) frente a
\mbox{$\Halt:\ \beta_1+\beta_2\ne10$} con una significación del
5\%. Calcule el \emph{p}-valor del estadístico.
\begin{verbatim}
# Hnula (b1+b2=10)  Halt (b1+b2~=10) Bilateral
scalar t5 = ($coeff(sqft)+$coeff(const)-10)/sqrt($vcv[1,1]+$vcv[2,2]+2*$vcv[1,2])
scalar c5 = critical(t,$df,.025)
scalar p5 = 2*pvalue(t,$df,abs(t5))
scalar f5 = t5^2
scalar pf5 = pvalue(f,1,$df,f5)
\end{verbatim}

\item Estos dos últimos contrastes son bilaterales. Los contrastes
bilaterales se pueden realizar fácilmente desde los menús de
Gretl. Compruebe que obtiene los mismos resultados abriendo la
ventana del modelo estimado y siguiendo los pasos \textbf{\emph{\texttt{Contrastes ->
   Restricciones lineales}}} y tecleando en la ventana
\begin{center}
\begin{tabular}{l}
\texttt{b[1] + b[2] = 10}\\[0pt]
\end{tabular}
\end{center}
Y pulse \textbf{\emph{\texttt{Aceptar}}}. Observe que Gretl usa el contraste
\(F\). Calcule el cuadrado del contraste \(t\) y compruebe que da
exactamente el mismo resultado.
\end{enumerate}

\clearpage
\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{HtestingHouses.inp}}
\label{sec:org5ed42d4}
\vspace{10pt}
\lstinputlisting{scripts/HtestingHouses.inp}
\clearpage


\section{\emph{p}-valor, potencia del contraste y otras distribuciones para las perturbaciones}
\label{sec:org5c7931d}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses4.inp}{samplinghouses4.inp}\\[0pt]
\end{tabular}
\end{center}

Este ejercicio es una modificación del guión \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses1.inp}{\texttt{samplinghouses1.inp}} de
la lección anterior.


\begin{description}
\item[{Nota 1}] En este ejercicio todos los contrastes son bilaterales

\item[{Nota 2}] Le recomiendo abrir directamente el guión
\href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses4.inp}{\texttt{samplinghouses4.inp}} y modificar lo que sea necesario para realizar
cada apartado.
\end{description}

Comencemos la práctica\ldots{}

A) En lugar de almacenar los valores estimados para los parámetros,
   este guión almacena los estadísticos \(t\) para el contraste \(\Hnula:
   b_1=52\) frente a \(\Halt: b_1\ne 52\), así como los \emph{p} valores de
   dichos estadísticos. Nótese que la hipótesis nula es cierta en este
   ejemplo simulado (¡esa es la ventaja de simular!).

B) Recupere esos datos almacenados y compruebe qué porcentaje de veces
   los \emph{p}-valores son mayores que 0.05 (cuantas veces hubiéramos
   rechazado \(\Hnula\) pese a ser cierta con una significación del
   5\%. ¿Le sorprende el resultado?)

C) Repita desde el principio el ejercicio, pero simulando
   perturbaciones con una distribución muy alejada de la normal (por
   ejemplo empleando una distribución \(\chi^2\) con un grado de
   libertad y restando 1 para que su esperanza sea nula: \texttt{gl=1} y
   \texttt{series U = randgen(X, gl) - gl}. ¿Cambian mucho los resultados?

D) Lo visto en el apartado anterior puede ser debido a que la muestra
   es muy pequeña. Repita el ejercicio pero simulando superficies de
   pisos.

\begin{itemize}
\item Comente la línea \texttt{open data3-1.gdt} y añada debajo \texttt{nulldata
     150}.

\item Comente \texttt{series x = sqft} y añada debajo \texttt{series x =
     randgen(U,1000,3000)}.
\end{itemize}

Es decir, simule (con distribución uniforme) tamaños de 150 pisos
con un rango igual al de la verdadera muestra (entre \(1000\) y \(3000\)
pies cuadrados).

Repita el ejercicio, con los datos simulados: primero con
distribución normal, y luego con una distribución alejada de la
Normal.

\begin{itemize}
\item ¿Cambian los resultados?

\item ¿Y si aumenta más aún el tamaño muestral? (por ejemplo \texttt{nulldata
     500}
\end{itemize}

E) \textbf{(Función potencia)} Vuelva a usar tamaños muestrales de 14 datos
   (bien empleando los datos originales, o bien simulando 14
   superficies), y simule perturbaciones con distribución normal.

Repita el ejercicio pero esta vez para contrastar hipótesis falsas,
por ejemplo \(\Hnula: b_1=50\), ó \(\Hnula: b_1=30\), ó \(\Hnula:
   b_1=100\) ó \(\Hnula: b_1=0\).

\begin{itemize}
\item ¿Puede encontrar una pauta en los los resultados?

\item ¿Sabe lo que es la potencia de un contraste?

\item ¿Depende de algún modo el comportamiento del test respecto del
tamaño muestral? Por ejemplo, contraste \(\Hnula: b_1=30\) con
muestras de \(14\), \(150\) y \(500\) datos. ¿Qué observa?

\item Si, siendo el verdadero parámetro \(52\), contrasta al 5\% la
hipótesis \(\Hnula: b_1=51.7\) ¿Se rechaza con mucha frecuencia
\Hnula?
\end{itemize}

F) En los apartados (A) y (D) (\emph{donde contrastábamos una hipótesis
  nula \(\Hnula: b_1=52\) que era cierta}) hemos visto que los
  resultados no parecían muy dependientes de la distribución de las
  perturbaciones.

Emplee una muestra de tamaño \(500\) y simule perturbaciones con
distribución \(\chi^2\) con un grado de libertad (y reste los grados
de libertad para que su esperanza sea nula).

Contraste al 5\% la falsa hipótesis \(\Hnula: b_1=51.7\).

El porcentaje de rechazos cuando empleamos distribución normal era
approx. el 5\%

\begin{itemize}
\item ¿qué pasa cuando simulamos una distribución muy alejada de la
normal? (\(\chi^2_1\))
\item ¿Y si aumenta el número de grados de libertad?
\item Pruebe con distribuciones \(\chi^2_{10}\), \(\chi^2_{25}\),
\(\chi^2_{50}\) y \(\chi^2_{100}\).
\end{itemize}

\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses4.inp}}
\label{sec:org4f0d3d2}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses4.inp}
\clearpage
\end{document}